# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

VAR1 = int(input("номер буквы в алфавите (1..26) "))
print(chr(VAR1 + 96))
